nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/mcpwm/processor/mcpwm_p32mk0512mcf100.h
PLIB_INLINE_API bool PLIB_MCPWM_ChannelCurrentLimitInterruptIsEnabled(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelCurrentLimitInterruptIsEnabled_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelCurrentLimitInterruptFlagClear(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelCurrentLimitInterruptFlagClear_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelCurrentLimitInterruptEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelCurrentLimitInterruptEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelCurrentLimitInterruptDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelCurrentLimitInterruptDisable_Default(index, channel);
}

PLIB_INLINE_API uint16_t PLIB_MCPWM_ChannelCurrentLimitCaptureRead(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelCurrentLimitCaptureRead_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelCurrentLimitIsAsserted(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelCurrentLimitIsAsserted_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelCurrentLimit(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelCurrentLimit_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelFaultSetup(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, MCPWM_FAULT_SOURCE mcpwm_fault_source, MCPWM_FAULT_INPUT_POLARITY mcpwm_fault_input_polarity, MCPWM_FAULT_OVERRIDE_PWMxH_VALUE mcpwm_fault_override_pwmh_value, MCPWM_FAULT_OVERRIDE_PWMxL_VALUE mcpwm_fault_override_pwml_value, MCPWM_FAULT_MODE mcpwm_fault_mode)
{
     MCPWM_ChannelFaultSetup_Default(index, channel, mcpwm_fault_source, mcpwm_fault_input_polarity, mcpwm_fault_override_pwmh_value, mcpwm_fault_override_pwml_value, mcpwm_fault_mode);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelFaultInterruptIsPending(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelFaultInterruptIsPending_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelFaultInterruptIsEnabled(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelFaultInterruptIsEnabled_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelFaultInterruptFlagClear(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelFaultInterruptFlagClear_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelFaultInterruptEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelFaultInterruptEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelFaultInterruptDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelFaultInterruptDisable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelFaultIsAsserted(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelFaultIsAsserted_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelFault(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelFault_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelChopSetup(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, MCPWM_CHOP_CLOCK_SOURCE chop_clock_source, MCPWM_PWMxH_CHOP_CONTROL mcpwm_pwmh_chop_control, MCPWM_PWMxL_CHOP_CONTROL mcpwm_pwml_chop_control)
{
     MCPWM_ChannelChopSetup_Default(index, channel, chop_clock_source, mcpwm_pwmh_chop_control, mcpwm_pwml_chop_control);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelChopSetup(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelChopSetup_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBSetup(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, MCPWM_FAULT_INPUT_LEB_CONTROL mcpwm_fault_input_leb_control, MCPWM_CURRENTLIMIT_INPUT_LEB_CONTROL mcpwm_currentlimit_input_leb_control, uint16_t leb_delay)
{
     MCPWM_ChannelLEBSetup_Default(index, channel, mcpwm_fault_input_leb_control, mcpwm_currentlimit_input_leb_control, leb_delay);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBTriggerPWMxHRisingEdgeEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelLEBTriggerPWMxHRisingEdgeEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBTriggerPWMxHFallingEdgeEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelLEBTriggerPWMxHFallingEdgeEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBTriggerPWMxLRisingEdgeEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelLEBTriggerPWMxLRisingEdgeEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBTriggerPWMxLFallingEdgeEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelLEBTriggerPWMxLFallingEdgeEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBTriggerPWMxHRisingEdgeDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelLEBTriggerPWMxHRisingEdgeDisable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBTriggerPWMxHFallingEdgeDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelLEBTriggerPWMxHFallingEdgeDisable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBTriggerPWMxLRisingEdgeDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelLEBTriggerPWMxLRisingEdgeDisable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelLEBTriggerPWMxLFallingEdgeDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelLEBTriggerPWMxLFallingEdgeDisable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelLEBSetup(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelLEBSetup_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelPeriodResetInterruptIsPending(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelPeriodResetInterruptIsPending_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelPeriodResetInterruptIsEnabled(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelPeriodResetInterruptIsEnabled_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPeriodResetInterruptFlagClear(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPeriodResetInterruptFlagClear_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPeriodResetInterruptEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPeriodResetInterruptEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPeriodResetInterruptDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPeriodResetInterruptDisable_Default(index, channel);
}

